young-nights/OTA-Upgrade-of-QI-Charger-Based-on-CAN/qi_wireless_code_slotA/libraries/drivers/src/at32f422_426_flash.c
  FLASH->ctrl_bit.usders = TRUE;
  FLASH->ctrl_bit.erstr = TRUE;
  /* wait for operation to be completed */
  status = flash_operation_wait_for(ERASE_TIMEOUT);

  /* disable the usders bit */
  FLASH->ctrl_bit.usders = FALSE;

  if(status == FLASH_OPERATE_DONE)
  {
    if(new_state == FALSE)
    {
      /* enable the user system data programming operation */
      FLASH->ctrl_bit.usdprgm = TRUE;
      USD->fap = FAP_RELIEVE_KEY;

      /* Wait for operation to be completed */
      status = flash_operation_wait_for(ERASE_TIMEOUT);

      /* disable the usdprgm bit */
      FLASH->ctrl_bit.usdprgm = FALSE;
    }
  }

  /* return the flash access protection operation status */
  return status;
}

/**
  * @brief  check the flash access protection status.
  * @param  none
  * @retval flash access protection status(SET or RESET)
  */
flag_status flash_fap_status_get(void)
{
  return (flag_status)FLASH->usd_bit.fap;
}

/**
  * @brief  enable or disable the flash access protection high level.
  * @note   if the user has already programmed the other user system data before calling
  *         this function, must re-program them since this function erase all user system data.
  * @note   once the fap high level enabled, the swd debugger port will be permanently disable!!!
  * @param  new_state: new state of the flash access protection high level.
  *         this parameter can be: TRUE or FALSE.
  * @retval status: the returned value can be: FLASH_PROGRAM_ERROR,
  *         FLASH_EPP_ERROR, FLASH_OPERATE_DONE or FLASH_OPERATE_TIMEOUT.
  */
flash_status_type flash_fap_high_level_enable(void)
{
  flash_status_type status = FLASH_OPERATE_DONE;

  /* unlock the user system data */
  FLASH->usd_unlock = FLASH_UNLOCK_KEY1;
  FLASH->usd_unlock = FLASH_UNLOCK_KEY2;
  while(FLASH->ctrl_bit.usdulks==RESET);

  FLASH->ctrl_bit.usders = TRUE;
  FLASH->ctrl_bit.erstr = TRUE;
  /* wait for operation to be completed */
  status = flash_operation_wait_for(ERASE_TIMEOUT);

  /* disable the usders bit */
  FLASH->ctrl_bit.usders = FALSE;

  if(status == FLASH_OPERATE_DONE)
  {
    /* enable the user system data programming operation */
    FLASH->ctrl_bit.usdprgm = TRUE;
    USD->fap = FAP_HIGH_LEVEL_KEY;

    /* wait for operation to be completed */
    status = flash_operation_wait_for(PROGRAMMING_TIMEOUT);

    /* disable the usdprgm bit */
    FLASH->ctrl_bit.usdprgm = FALSE;
  }

  /* return the flash access protection operation status */
  return status;
}

/**
  * @brief  check the flash access protection high level status.
  * @param  none
  * @retval flash access protection high level status(SET or RESET)
  */
flag_status flash_fap_high_level_status_get(void)
{
  return (flag_status)FLASH->usd_bit.fap_hl;
}

/**
  * @brief  program the flash system setting byte in usd: wdt_ato_en / depslp_rst / stdby_rst / boot1 / depslp_wdt / stdby_wdt
  * @param  usd_ssb0: the system setting byte0
  * @note   this parameter usd_ssb must contain a combination of all the following 6 types of data
  *         type 1: wdt_ato_en, select the wdt auto start
  *         this data can be one of the following values:
  *         - USD_WDT_ATO_DISABLE: disable wdt auto start
  *         - USD_WDT_ATO_ENABLE: enable wdt auto start
  *         type 2: depslp_rst, reset event when entering deepsleep mode.
  *         this data can be one of the following values:
  *         - USD_DEPSLP_NO_RST: no reset generated when entering in deepsleep
  *         - USD_DEPSLP_RST: reset generated when entering in deepsleep
  *         type 3: stdby_rst, reset event when entering standby mode.
  *         this data can be one of the following values:
  *         - USD_STDBY_NO_RST: no reset generated when entering in standby
  *         - USD_STDBY_RST: reset generated when entering in standby
  *         type 4: boot1, at startup, when boot0 pin is high level, selected the device boot from bootmem/sram.
  *         this data can be one of the following values:
  *         - USD_BOOT1_LOW: when boot0 is high level, boot from bootmem
  *         - USD_BOOT1_HIGH: when boot0 is high level, boot from sram
  *         type 5: depslp_wdt, wdt stop count when entering deepsleep mode.
  *         this data can be one of the following values:
  *         - USD_DEPSLP_WDT_CONTINUE: wdt continue count when entering in deepsleep
  *         - USD_DEPSLP_WDT_STOP: wdt stop count when entering in deepsleep
  *         type 6: stdby_wdt, wdt stop count when entering standby mode.
  *         this data can be one of the following values:
  *         - USD_STDBY_WDT_CONTINUE: wdt continue count when entering in standby
  *         - USD_STDBY_WDT_STOP: wdt stop count when entering in standby
  * @retval status: the returned value can be: FLASH_PROGRAM_ERROR,
  *         FLASH_EPP_ERROR, FLASH_OPERATE_DONE or FLASH_OPERATE_TIMEOUT.
  */
flash_status_type flash_ssb0_set(uint8_t usd_ssb0)
{
  flash_status_type status = FLASH_OPERATE_DONE;

  /* unlock the user system data */
  FLASH->usd_unlock = FLASH_UNLOCK_KEY1;
  FLASH->usd_unlock = FLASH_UNLOCK_KEY2;
  while(FLASH->ctrl_bit.usdulks==RESET);

  /* enable the user system data programming operation */
  FLASH->ctrl_bit.usdprgm = TRUE;

  USD->ssb0 = usd_ssb0;
  /* wait for operation to be completed */
  status = flash_operation_wait_for(PROGRAMMING_TIMEOUT);

  /* disable the usdprgm bit */
  FLASH->ctrl_bit.usdprgm = FALSE;

  /* return the user system data program status */
  return status;
}

/**
  * @brief  program the flash system setting byte in usd: boot0_sw / boot0 / nrst_mode
  * @param  usd_ssb1: the system setting byte1
  * @note   this parameter usd_ssb1 must contain a combination of all the following 3 types of data
  *         type 1: boot0_sw, configure the boot0_sw.
  *         this data can be one of the following values:
  *         - USD_BOOT0_SW_DISABLE: boot0 state refer to pin.
  *         - USD_BOOT0_SW_ENABLE: boot0 state refer to bit.
  *         type 2: boot0, configure the boot0.
  *         this data can be one of the following values:
  *         - USD_BOOT0_LOW: nboot0 is 0
  *         - USD_BOOT0_HIGH: nboot0 is 1
  *         type 3: nrst_mode, select nrst mode.
  *         this data can be one of the following values:
  *         - USD_NRST_MODE_NRST: nrst pin with nrst mode
  *         - USD_NRST_MODE_GPIO: nrst pin with gpio mode
  * @retval status: the returned value can be: FLASH_PROGRAM_ERROR,
  *         FLASH_EPP_ERROR, FLASH_OPERATE_DONE or FLASH_OPERATE_TIMEOUT.
  */
flash_status_type flash_ssb1_set(uint8_t usd_ssb1)
{
  flash_status_type status = FLASH_OPERATE_DONE;

  /* unlock the user system data */
  FLASH->usd_unlock = FLASH_UNLOCK_KEY1;
  FLASH->usd_unlock = FLASH_UNLOCK_KEY2;
  while(FLASH->ctrl_bit.usdulks==RESET);

  /* enable the user system data programming operation */
  FLASH->ctrl_bit.usdprgm = TRUE;

  USD->ssb1 = usd_ssb1;
  /* wait for operation to be completed */
  status = flash_operation_wait_for(PROGRAMMING_TIMEOUT);

