young-nights/OTA-Upgrade-of-QI-Charger-Based-on-CAN/qi_wireless_code_slotA/libraries/drivers/src/at32f422_426_flash.c
  /* disable the usdprgm bit */
  FLASH->ctrl_bit.usdprgm = FALSE;

  /* return the user system data program status */
  return status;
}

/**
  * @brief  return the flash system setting byte0 status.
  * @param  none
  * @retval values from flash_usd register: wdt_ato_en(bit0), depslp_rst(bit1),
  *         stdby_rst(bit2), boot1(bit4), depslp_wdt(bit5), stdby_wdt(bit6).
  */
uint8_t flash_ssb0_status_get(void)
{
  /* return the system setting byte status */
  return (uint8_t)(FLASH->usd >> 2);
}

/**
  * @brief  return the flash system setting byte1 status.
  * @param  none
  * @retval values from flash_usd register: boot0_sw(bit0), boot0(bit1),
  *         nrst_mode(bit2, biit3).
  */
uint8_t flash_ssb1_status_get(void)
{
  /* return the system setting byte status */
  return (uint8_t)(FLASH->usd >> 10);
}

/**
  * @brief  enable or disable the specified flash interrupts.
  * @param  flash_int: specifies the flash interrupt sources to be enabled or disabled.
  *         this parameter can be any combination of the following values:
  *         - FLASH_ERR_INT
  *         - FLASH_ODF_INT
  * @param  new_state: new state of the specified flash interrupts.
  *         this parameter can be: TRUE or FALSE.
  * @retval none
  */
void flash_interrupt_enable(uint32_t flash_int, confirm_state new_state)
{
  if(flash_int & FLASH_ERR_INT)
    FLASH->ctrl_bit.errie = new_state;
  if(flash_int & FLASH_ODF_INT)
    FLASH->ctrl_bit.odfie = new_state;
}

/**
  * @brief  enable main block security library function.
  * @param  pwd: slib password
  *         start_sector: security library start sector
  *         inst_start_sector: security library i-bus area start sector
  *         end_sector: security library end sector
  * @retval status: the returned value can be: FLASH_PROGRAM_ERROR,
  *         FLASH_EPP_ERROR, FLASH_OPERATE_DONE or FLASH_OPERATE_TIMEOUT.
  */
flash_status_type flash_slib_enable(uint32_t pwd, uint16_t start_sector, uint16_t inst_start_sector, uint16_t end_sector)
{
  uint32_t slib_range;
  flash_status_type status = FLASH_OPERATE_DONE;

  /*check range param limits*/
  if((start_sector > inst_start_sector) || ((inst_start_sector > end_sector) && \
     (inst_start_sector != 0x7FF)) || (start_sector > end_sector))
    return FLASH_PROGRAM_ERROR;

  /* unlock slib cfg register */
  FLASH->slib_unlock = SLIB_UNLOCK_KEY;
  while(FLASH->slib_misc_sts_bit.slib_ulkf==RESET);

  slib_range = ((uint32_t)(inst_start_sector << 11) & FLASH_SLIB_INST_START_SECTOR) | \
               ((uint32_t)(end_sector << 22) & FLASH_SLIB_END_SECTOR) | \
               (start_sector & FLASH_SLIB_START_SECTOR);
  /* configure slib, set pwd and range */
  FLASH->slib_set_pwd = pwd;
  status = flash_operation_wait_for(PROGRAMMING_TIMEOUT);
  if(status == FLASH_OPERATE_DONE)
  {
    FLASH->slib_set_range = slib_range;
    status = flash_operation_wait_for(PROGRAMMING_TIMEOUT);
  }

  return status;
}

/**
  * @brief  disable main block slib when slib enabled.
  * @param  pwd: slib password
  * @retval success or error
  */
error_status flash_slib_disable(uint32_t pwd)
{
  flash_status_type status = FLASH_OPERATE_DONE;
  /* write password to disable slib */
  FLASH->slib_pwd_clr = pwd;

  status = flash_operation_wait_for(ERASE_TIMEOUT);
  if(status == FLASH_OPERATE_DONE)
  {
    if(FLASH->slib_misc_sts_bit.slib_pwd_ok)
      return SUCCESS;
    else
      return ERROR;
  }
  return ERROR;
}

/**
  * @brief  get the main block slib state.
  * @param  none
  * @retval SET or RESET
  */
flag_status flash_slib_state_get(void)
{
  if(FLASH->slib_sts0_bit.slib_enf)
    return SET;
  else
    return RESET;
}

/**
 * @brief  get the main block start sector of slib.
 * @param  none
 * @retval uint16_t
 */
uint16_t flash_slib_start_sector_get(void)
{
  return (uint16_t)FLASH->slib_sts1_bit.slib_ss;
}

/**
 * @brief  get the main block inst start sector of slib.
 * @param  none
 * @retval uint16_t
 */
uint16_t flash_slib_inststart_sector_get(void)
{
  return (uint16_t)FLASH->slib_sts1_bit.slib_inst_ss;
}

/**
 * @brief  get the main block end sector of slib.
 * @param  none
 * @retval uint16_t
 */
uint16_t flash_slib_end_sector_get(void)
{
  return (uint16_t)FLASH->slib_sts1_bit.slib_es;
}

/**
  * @brief  flash crc calibration.
  * @param  start_addr: crc calibration start sector address
  *         sector_cnt: crc calibration sector count
  * @retval uint32: crc calibration result
  */
uint32_t flash_crc_calibrate(uint32_t start_addr, uint32_t sector_cnt)
{
  FLASH->crc_addr = start_addr;
  FLASH->crc_ctrl = sector_cnt | 0x10000;
  flash_operation_wait_for(OPERATION_TIMEOUT);
  return FLASH->crc_chkr;
}

/**
  * @brief  enable boot memory as extension mode.
  * @note   this function is irreversible, can not disable!!!
  * @param  none
  * @retval none.
  */
void flash_boot_memory_extension_mode_enable(void)
{
  if(FLASH->slib_sts0_bit.btm_ap_enf == RESET)
  {
    FLASH->slib_unlock = SLIB_UNLOCK_KEY;
    while(FLASH->slib_misc_sts_bit.slib_ulkf==RESET);
    FLASH->btm_mode_set = 0;
    flash_operation_wait_for(OPERATION_TIMEOUT);
  }
}

/**
  * @brief  enable extension memory security library function.
  * @param  pwd: slib password
  *         inst_start_sector: extension memory security library i-bus area start sector, range 0~3 or 0xFF
  * @retval status: the returned value can be: FLASH_PROGRAM_ERROR,
  *         FLASH_EPP_ERROR, FLASH_OPERATE_DONE or FLASH_OPERATE_TIMEOUT.
  */
flash_status_type flash_extension_memory_slib_enable(uint32_t pwd, uint16_t inst_start_sector)
{
  flash_status_type status = FLASH_OPERATE_DONE;

  /* unlock slib cfg register */
  FLASH->slib_unlock = SLIB_UNLOCK_KEY;
  while(FLASH->slib_misc_sts_bit.slib_ulkf==RESET);

  /* configure slib, set pwd and range */
  FLASH->slib_set_pwd = pwd;
  status = flash_operation_wait_for(PROGRAMMING_TIMEOUT);
  if(status == FLASH_OPERATE_DONE)
  {
    FLASH->em_slib_set  = (uint32_t)(inst_start_sector << 16) + (uint32_t)0x5AA5;
    status = flash_operation_wait_for(PROGRAMMING_TIMEOUT);
  }

