young-nights/OTA-Upgrade-of-QI-Charger-Based-on-CAN/qi_wireless_code_slotA/libraries/drivers/src/at32f422_426_flash.c
  return status;
}

/**
  * @brief  get the extension memory slib state.
  * @param  none
  * @retval SET or RESET
  */
flag_status flash_extension_memory_slib_state_get(void)
{
  if(FLASH->slib_sts0_bit.em_slib_enf)
    return SET;
  else
    return RESET;
}

/**
 * @brief  get the extension memory inst start sector of slib.
 * @param  none
 * @retval uint16_t
 */
uint16_t flash_em_slib_inststart_sector_get(void)
{
  return (uint16_t)FLASH->slib_sts0_bit.em_slib_inst_ss;
}

/**
  * @brief  start programing otp data from the specified address.
  * @note   the otp data can't erase!
  * @param  address: specifies the address to be programmed. the starting address is OTP_DATA_BASE.
  * @param  data_buf: specifies the otp data pointer to be programmed.
  * @param  length: specifies the length to be programmed.
  * @retval status: the returned value can be: FLASH_PROGRAM_ERROR,
  *         FLASH_EPP_ERROR, FLASH_OPERATE_DONE or FLASH_OPERATE_TIMEOUT.
  */
flash_status_type flash_otp_data_program(uint32_t address, uint8_t *data_buf, uint16_t length)
{
  flash_status_type status = FLASH_OPERATE_DONE;

  FLASH->ctrl_bit.fprgm = TRUE;
  while(length--)
  {
    *(__IO uint8_t*)(address++) = *(data_buf++);
    /* wait for operation to be completed */
    status = flash_operation_wait_for(PROGRAMMING_TIMEOUT);
    if(status != FLASH_OPERATE_DONE)
      break; 
  }
  /* disable the fprgm bit */
  FLASH->ctrl_bit.fprgm = FALSE;

  return status;
}

/**
  * @brief  lock the specified otp data area.
  * @note   when the specified otp data area locked, it can't unlock!
  * @param  area_index: lock otp area index(0~31).
  *         each index corresponds to 32 bytes of otp data, locked otp data area starting address is OTP_DATA_BASE + 32 * area_index.
  * @retval status: the returned value can be: FLASH_PROGRAM_ERROR,
  *         FLASH_EPP_ERROR, FLASH_OPERATE_DONE or FLASH_OPERATE_TIMEOUT.
  */
flash_status_type flash_otp_lock_enable(uint8_t area_index)
{
  flash_status_type status = FLASH_OPERATE_DONE;

  FLASH->ctrl_bit.fprgm = TRUE;

  *(__IO uint8_t*)(OTP_LOCK_BASE + area_index) = 0x00;
  /* wait for operation to be completed */
  status = flash_operation_wait_for(PROGRAMMING_TIMEOUT);

  /* disable the fprgm bit */
  FLASH->ctrl_bit.fprgm = FALSE;

  return status;
}

/**
  * @}
  */

#endif

/**
  * @}
  */

/**
  * @}
  */
